Revit 2026 API

# ElementName Property

---

A human readable name for the Element.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual string Name { get; set; }
```
```vb
Public Overridable Property Name As String
	Get
	Set
```
```cpp
public:
virtual property String^ Name {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
abstract Name : string with get, set
override Name : string with get, set
```

#### Property Value

String

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Thrown when the name of the element cannot be changed. |
| ArgumentException | Thrown when the element requires a unique name and a non-unique name is set. |

The Name property is a human readable name for the element, such as Wall.

#### Reference

Element Class

Autodesk.Revit.DB Namespace